'-------------------------------------------------------------------------------------
' Romanian language module for WINCONTIG
'
' Translated by:
'   Beczuk David (beczukdavid<at>gmail<dot>com)
'
' Currently maintained by:
'   Marco D'Amato (md<at>mdtzone<dot>it) and Beczuk David (beczukdavid<at>gmail<dot>com)
'
' Last updated: September 06, 2009
'
' NOTE: Don't translate '\n', '\t', '%s', '$c$' or '$d$'
'
'-------------------------------------------------------------------------------------
' Language Name of the module in your native language ***
' (e.g. Italiano, Français, etc)
'-------------------------------------------------------------------------------------
LNG=Romaneste, RO
'-------------------------------------------------------------------------------------
' File info panel ***
'-------------------------------------------------------------------------------------
1=Fisiere Fragmentate
2=Fisiere Adiacente
3=Fisiere Defragmentate
4=Fisiere Neprocesate
'-------------------------------------------------------------------------------------
' Main program window - Toolbar buttons labels ***
'-------------------------------------------------------------------------------------
17=Adauga
18=Sterge
19=Proprietati
20=Incarca Profil
21=Salveaza Profil
283=Fragmente
294=Vezi Raport
455=Filter
24=Defragment
25=Stop
'-------------------------------------------------------------------------------------
' Main program window - Toolbar buttons tooltips ***
'-------------------------------------------------------------------------------------
473=Adauga
474=Adauga una sau mai multe fisiele la lista. Dati clic pe sageata pentru a adauga dosare.
475=Sterge
476=Sterge elementele selectate din lista.
477=Proprietati
478=Afiseaza proprietatile elementelor selectate.
479=Fragmente
480=Afiseaza informatii aditionale despre fisierele selectate, inclusiv dimensiune si numar de fragmente din care este compus fisierul.
481=Filtru
482=Afiseaza fereastra de Filtru pentru a putea selecta excluderea sau includerea anumitor fisiere, dosare sau tipuri de fisiere in analiza fragmentarii.
483=Incarca profil
484=Incarca o lista de elemente salvate intr-un fisier profil anterior.
485=Salvare profil
486=Salvare lista de elemente ca fisier profil.
26=Analizeaza
45=Analizeaza fisirele in ordine pentru a vedea nivelul de fragmentare.
101=Defragmentare
139=Unifica fisierele fragmentate pentru a marii performata sistemului.Faceti clic pe sageata pentru a defragmenta doar fisierele selectate in panoul inferior.
122=Stop
136=Opreste processul care este activ.
'-------------------------------------------------------------------------------------
' Main program window - Toolbar Drop Down Menu ("Add" button) ***
'-------------------------------------------------------------------------------------
65=Adauga &Fisier...\tCTRL+O
66=Adauga D&osar...\tCTRL+D
'-------------------------------------------------------------------------------------
' Main program window - Toolbar Drop Down Menu ("Profile" button) ***
'-------------------------------------------------------------------------------------
155=<gol>
'-------------------------------------------------------------------------------------
' Main program window - Toolbar Drop Down Menu ("Defragment" button) ***
'-------------------------------------------------------------------------------------
365=&Defragmenteaza toate fisierele
156=Defragmenteaza doar fisierele fragmentate &selectate
'----------------------------------------------------------------------------------------------
' Main program window - Items to be processed (Column Headers/Column Header Context Menu) ***
'----------------------------------------------------------------------------------------------
27=Nume
28=Dimensiune
29=Status
30=Tip
248=Fragmente
249=Clustere
250=Dimensiune pe disc
274=% pe Disc
472=Last Modified Date
487=Attributes
251=Standard
'-------------------------------------------------------------------------------------
' Main program window - Items to be processed ("Status" Column) ***
'-------------------------------------------------------------------------------------
5=Fragmentat
6=Nefragmentat
7=Eroare
8=Defragmentat
146=Adiacente
368=Oprit
369=Ignorat
424=Informatia se proceseaza...
'-------------------------------------------------------------------------------------
' Main program window - Items to be processed (misc) ***
'-------------------------------------------------------------------------------------
31=Adaugati obiecte pentru defragmentat aici.
247=Dosar
'-------------------------------------------------------------------------------------
' Main program window - Items to be processed (Context Menu) ***
'-------------------------------------------------------------------------------------
67=&Deschide
68=&Adauga Obiect
69=&Fisier...\tCTRL+O
70=D&osar...\tCTRL+D
71=&Sterge Elemente\tDEL
371=Adauga la lista de E&xcluderi
15=Analizea&za elementele selectate
16=&Defragmenteaza elementele selectate
72=&Incarca Profil...
73=&Salveaza Profil Ca...
223=Prop&rietati...
75=A&uto derulare
'--------------------------------------------------------------------------------------------------
' Main program window - "Fragmented files" Tab (Column Headers/Column Header Context Menu) ***
'--------------------------------------------------------------------------------------------------
9=Fragmente
252=Clustere
253=Dimensiunea pe disc
10=Dimensiune
11=Nume fisier
275=% pe Disc
256=Standard
'-------------------------------------------------------------------------------------
' Main program window - "Fragmented files" Tab (misc) ***
'-------------------------------------------------------------------------------------
144=Fisiere Fragmentate
12=Nu a fost gasit nici un fisier fragmentat.
428=Nici un fisier nu a fost procesat inca
'-------------------------------------------------------------------------------------
' Main program window - "Fragmented files" Tab (Context Menu) ***
'-------------------------------------------------------------------------------------
363=&Selecteaza fisierele marcate
364=&Deselecteaza fisierele marcate
367=&Inverseaza selectia
372=Adauga la lista E&xcluderilor
162=Deschide locatia fisierului
'--------------------------------------------------------------------------------------------------
' Main program window - "Fragmented files" listview (checkbox) tooltip ***
'--------------------------------------------------------------------------------------------------
171=Selectare/Deselectare
161=Selectati sau deselectati toate fisierele listate.
'--------------------------------------------------------------------------------------------------
' Main program window - "Errors" Tab (Column Headers) ***
'--------------------------------------------------------------------------------------------------
128=Nume Fisier
129=Eroare
'--------------------------------------------------------------------------------------------------
' Main program window - "Errors" Tab (misc) ***
'--------------------------------------------------------------------------------------------------
98=Fisiere neanalizate
145=Nu au fost intalnite erori in timpul procesarii fisierelor.
'-------------------------------------------------------------------------------------
' Main program window - Statusbar messages ***
'-------------------------------------------------------------------------------------
32=Inactiv
33=Obiecte totale listate: 
127=Obiect
137=Defragmentez
420=Total fisiere procesate:
'-------------------------------------------------------------------------------------
' Main program window - File menu ***
'-------------------------------------------------------------------------------------
34=&Fisier
35=&Deschide
36=&Adauga Obiect
37=&Fisier...\tCTRL+O
38=Do&sar...\tCTRL+D
39=&Sterge intrare\tDEL
370=Adauga la lista de E&xcluderi
284=Infor&matii Fragment...
224=Prop&rietati...
421=Sa&lveaza Reportul Analizei...
41=Ie&sire
'-------------------------------------------------------------------------------------
' Main program window - Profiles menu ***
'-------------------------------------------------------------------------------------
42=&Profile
43=&Incarca Profil...
44=&Salveaza Profil Ca...
157=&Configureaza Lista de Profile Recenta...
'-------------------------------------------------------------------------------------
' Main program window - Action menu ***
'-------------------------------------------------------------------------------------
46=&Actiuni
47=A&nalizeaza
49=&Stop
50=&Defragmenteaza
148=Anali&zeaza elementele selectate
150=D&efragmenteaza elementele selectate
'-------------------------------------------------------------------------------------
' Main program window - View menu ***
'-------------------------------------------------------------------------------------
48=&View
51=&Toolbar
52=&Info Panel
76=&Status Bar
'-------------------------------------------------------------------------------------
' Main program window - Tools menu ***
'-------------------------------------------------------------------------------------
377=&Utilitati
470=&Manage filter...
'-------------------------------------------------------------------------------------
' Main program window - Options menu ***
'-------------------------------------------------------------------------------------
53=&Optiuni
54=Fereasta f&ocalizata
55=Selecteaza Rand &Complet
56=Arata &Mesaj Confirmare
57=Nu permite intrari &duplicate
58=&Inchide program dupa defragmentare
59=&Inchide calculatorul dupa terminare defragmentare
229=Nu verifa &volumele de erori
235=Strategie de D&efragmentare
236=Rapi&d
237=&Inteligent
242=&Limba
301=Seteaza Priori&tatea
302=&Inalta
303=&Medie
304=&Normala
305=&Sub Normal
306=&Joasa
332=&Curatare Disc
333=&Dezactivat
334=&Automatic
335=I&ntreaba utilizator
361=Arata &mesaj de eroare
348=Verifica &volumurile de erori
349=&Dezactivat
350=&Automatic
351=I&ntreaba utilizator
408=Configurare &marcaje...
488=Skip SSD dis&ks
23=Disa&ble Solid State Drive (SSD) detection
102=Afiseaza icoanele de st&are
140=Afiseaza icoanele de s&istem
'-------------------------------------------------------------------------------------
' Main program window - Help menu ***
'-------------------------------------------------------------------------------------
60=&Ajutor
61=Arata &termenii de utilizare
62=Arata scurtaturile in linie de &comanda
64=&Despre WinContig...
'-------------------------------------------------------------------------------------
' Menu Hints ***
'-------------------------------------------------------------------------------------
83=Adauga fisiere la lista de fisiere.
84=Adauga un dosar la lista de fisiere.
85=Sterge elementul selectat din lista de fisiere.
86=Adauga elementele listate in profil la lista de fisiere.
87=Salveaza elementele din lista de fisiere intr-un profil.
88=Parasete aplicatia WinContig.
89=Analizeaza elementele.
92=Va permite sa intrerupeti procesul de adaugare.
93=Va permite sa intrerupeti procesul de analiza.
110=Defragmenteaza fisierele.
94=Fixeaza aplicatia in prim plan permanent.
95=Activeaza sau dezactiveaza selectia de rand complet.
96=Afiseaza informatii despre program, versiunea si copyright-tul.
99=Inchide programul dupa terminarea procesului de defragmentare.
100=Inchide calculatorul dupa terminarea procesului de defragmentare.
103=Activeaza sau dezactiveaza derularea measajelor.
104=Activeaza sau dezactiveaza measajele.
105=Deschide fisierele selectate cu aplicatiile aferente.
106=Afiseaza liniile de comanda acceptate de WinContig.
107=Afiseaza drepturile de autor.
108=Nu permite adaugare de dubluri in lista de elemente.
225=Afiseaza proprietatile elementului selectat. 
230=Nu verifica discul de erori inaintea defragmentarii.
238=Defragmenteaza fisierele fara sa optimizeze pozitia clusterelor (rapid).
239=Defragmenteaza fisierele optimizand pozitia clusterelor (incet).
255=Afiseaza raport despre analiza efectuata.
285=Afiseaza informatii suplimentare despre framentarea sisierelor.
336=Nu sterge Fisierele Temporare inintea defragmentarii fisierelor.
337=Sterge automat fisierele temporare inaintea inceperii procesului de defragmentare.
109=Intreaba utilizatorul daca doreste sa stearga fisierele temporare inaintea defragmentarii fisierelor.
352=Nu verifica fisierele de erori inaintea defragmentarii fisierelor.
353=Verifica automat discul de erori inaintea defragmentarii.
354=Intreaba utilizatorul daca doreste o verificare a discului inaintea inceperii procesului de defragmentare.
362=Asiseaza mesajele de eroare care internin in timpul procesului de stergere a fisierelor temporare.
373=Adauga elementele selectate la lista de excludere de la defragmentare.
471=Manages the Exclusion and Inclusion Lists.
409=Schimba culoarea cu care sunt marcate rezultatele afisate.
429=Inverseaza selectia elementelor deja selectate.
430=Selecteaza elementele marcate.
431=Deselecteaza elementele marcate.
422=Salveaza rezultatul analizei.
22=Nu detecteaza automat SSD-urile (Solid Stade Drive)
13=Nu defragmenteaza fisiere pe discuri SSD (Solid State Drive)
82=Afiseaza sau ascunde bara de unelte.
90=Afiseaza sau ascunde panoul de informatii.
91=Afiseaza sau ascunde bara de status.
14=Defragmenteaza doar fisierele selectate in panoul inferior.
141=Va permite sa intrerupeti procesul in derulare.
131=Analizeaza doar elementele din panoul superior.
138=Defragmenteaza doar elementele selectate din panoul superior.
158=Confugureaza numarul de Profile care sa apara in Lista de Profile Recente
135=Afiseaza icoanele de stare langa fiecare icoana de item in panoul superior.
160=Afiseaza icoanele de system langa fiecare item in loc de icoanele WinContig.
163=Deschide calea catre fisierul selectat.
'-------------------------------------------------------------------------------------
' Analysis Report ***
'-------------------------------------------------------------------------------------
177=Numarul de fisiere fragmentate
178=Numarul de fisiere alaturate
179=Numarul de fisiere neanalizate datorita erorilor de procesare
182=Numarul de fisiere procesate
231=Lista fisierelor fragmentate:
232=Lista fisierelor care nu au fost analizate:
289=Fisiere Text (*.txt)|*.txt|All Files (*.*)|*.*|
290=Salveaza Raport
291=Raportul a fost salvat cu succes.
292=Analysis Report of WinContig created:
293=File Statistics
'-------------------------------------------------------------------------------------
' "Add files" dialog box ***
'-------------------------------------------------------------------------------------
111=Adauga fisier(e)
112=Toate Fisierele (*.*)|*.*|
'-------------------------------------------------------------------------------------
' "Add folder" dialog box ***
'-------------------------------------------------------------------------------------
113=Selectati dosarul pe care doriti sa il adaugati, apoi apasati butonul Adauga Dosar. Puteti adauga mai multe dosare la lista.
244=Adauga &dosar
246=Adauga dosar la lista
'-------------------------------------------------------------------------------------
' "Load profile" dialog box ***
'-------------------------------------------------------------------------------------
114=Incarca profil
115=Profile de WinContig (*.wcp)|*.wcp|Toate Fisierele (*.*)|*.*|
'-------------------------------------------------------------------------------------
' "Save profile" dialog box ***
'-------------------------------------------------------------------------------------
116=Salveaza profil
117=Profile de WinContig (*.wcp)|*.wcp|Toate Fisierele (*.*)|*.*|
118=Profilul a fost salvat cu succes.
'-------------------------------------------------------------------------------------
' "Importing profile" dialog box ***
'-------------------------------------------------------------------------------------
119=Importa profil
120=&Adauga
121=&Inlocuieste
123=Lista de fisiere nu este goala.
124=Apasati Adauga pentru a adauga elementele listate in profil la elementele existente in lista de fisiere. Apasati Inlocuieste pentru a inlocuii elementele din lista de fisiere cu cele din lista de profil.
125=Fisierul '%s' nu este un profil valid al programului WinContig.
126=Profilul specificat prin linia de comanda nu exista.
'-------------------------------------------------------------------------------------
' "Importing profile" dialog box - Items don't exist ***
'-------------------------------------------------------------------------------------
40=Elemente
130=Importare Profil
132=Elementele listate in profil nu pot fi gasite. Elementele poate au fost redenumite, mutate sau sterse.
133=Lista elementelor care nu au fost imporatate:
'-------------------------------------------------------------------------------------
' "Check disk" dialog box ***
'-------------------------------------------------------------------------------------
308=Verifica Disc
320=Inainte de a incepe procesul de defragmentare, puteti verifica volumul de erori. Este foarte recomandata verificarea integritatii fisierelor stocate pe disc inaintea defragmntarii.
309=In viitor, nu verifica &discul
310=Analizez discul %s... va rog asteptati.
311=Progres:
321=Stadiul 1 din 3
355=Stadiul 2 din 3
356=Stadiul 3 din 3
313=Verifica &Disc
314=Nu &verifica Discul
315=Eroare de disc!
316=Au fost gasite erori in timpul verificarii discului. Este extrem de important sa inchideti WinContig si sa reparati erorile de disc inainte de a continua.
317=Windows nu poate rula verificare de disc pe CD-ROM si DVD-ROM.
318=WinContig a detectat probleme pe disc. Va recomand sa parasiti aplicatia si sa remediati problemele.\nSau totodata, puteti continua normal.
319=Porneste automat procesul de def&ragmentare daca nu au fost gasite probleme.
323=Arata detaliile
324=Discul inca nu a fost analizat.
325=Ascunde detaliile
326=Procesul de verificare al discului este complet
328=Rapoarte scanare:
329=Nu au fost gasite probleme pe disc.
330=Verifica discul de erori
331=Windows nu poate verifica un disc atasat prin retea.
432=Volume
433=File System
434=Total size
435=Free space
436=% Free space
437=Unknown drive
438=Removable drive
439=Hard drive
440=Remote drive
441=Optical drive
442=RAM disk
443=Session Status
444=Analyzing...
445=Complete
'-------------------------------------------------------------------------------------
' "Disk Cleanup" dialog box ***
'-------------------------------------------------------------------------------------
339=Curatare Disc
340=Sterg fisierele temporare
357=Porne&ste Curatarea de disc
358=&Nu pornii curatarea de disc
338=Pe viitor, nu sterge fisierele &temporare
359=Inainte de a pornii procesul de defragmentare, poti sa stergi fisierele temporare pentru a elibera spatiu.
342=Estimare...
343=Sterg fisierele temporare... Va rog asteptati.
344=Progres:
345=Functia GetTempPath a esuat cu eroarea %s !
346=Fisierele temporare nu pot fi sterse pentru ca sunt in dosarul radacina !
347=Fisierele temporare nu pot fi sterse deoarece urmatoarea Cale temporara nu exista:\n\n%s
446=Use &WinContig to delete temporary files
447=Use &external application to delete temporary files
448=Program:
449=Alte comutatoare de linie de comanda:
450=&Navigheaza...
451=Selecteaza program
452=Programe (*.exe)|*.exe|Toate Fisierele (*.*)|*.*|
453=Nu a fost specificata nici o aplicatie externa.
454=Aplicatia externa specificata nu exista. !
'-------------------------------------------------------------------------------------
' "Exclusion/Inclusion List" dialog box ***
'-------------------------------------------------------------------------------------
469=Filtru
381=Adauga &Dosar...
382=Adauga &fisier...
399=Adauga &masca...
383=Elimina &element
385=Pentru a prevenii relocarea unor date, puteti exclude anumite elemente din procesul de defragmentare. Fisierele si dosarele din lista de excludere nu vor fi analizate si/sau defragmentate.
386=Lista de excluderi
387=Lista de elemente excluse:
388=%s elemente excluse de la defragmentare.
391=Ignora fisiere mai mari de (KB):
392=KB
393=MB
394=GB
456=Filtru 
457=&Adauga masca
458=&Sterge masca
459=Masca de adaugat:
460=Pentru a procesa elemente specifice, puteti sa setati una sau mai multe masti. WinContig va procesa doar acele elemente care se potrivesc mastilor listate in aceasta fereastra. In order to process specific items, you can setup one or more masks. WinContig will process only the items that match the masks listed in this window. To specify multiple masks, separate each mask by a semicolon (;).
461=Manage inclusion list
462=List of Included Items:
463=Exclude
464=Include
'-------------------------------------------------------------------------------------
' "Mask file" dialog box ***
'-------------------------------------------------------------------------------------
400=Adauga masca
401=Specificati una sau mai multe masti pentru a exclude fisiere si/sau dosare. Pentru a specifica masti multiple, separati fiercare masca cu punct si virgula (;).\n\nExemplu: *.dll;*.ocx;*.tmp
404=Masca nu poate contine urmatoarele caractere: \ / : < > | "
419=Caracterul nu este valid
405=Exclude masca:
402=&Adauga
'-------------------------------------------------------------------------------------
' "Configure highlighting" dialog box ***
'-------------------------------------------------------------------------------------
410=Configurare marcaje
411=Aici puteti configura marcajul cu culori al elementelor. Pentru a schimba culoarea unui element, selectati culoarea apasand butonul aferent din dreapta. Pentru a activa sau deactiva marcajele, trebuie doar sa bifati sau debifati casutele corespunzatoare din dreptul fiecarui marcaj.
412=Element fragmentat
413=Element continuu
414=Element defragmentat
415=Eroare
416=Element sarit
418=Marcare coloana intreaga
'-------------------------------------------------------------------------------------
' "Configure Profiles List" dialog box ***
'-------------------------------------------------------------------------------------
151=Lista de Profile Recente
152=Configureaza Lista de Profile Recente
153=Aici puteti configura cate profile sunt afisate in Lista de Profile.
154=Numarul de profile care se vor afisa(0-10):
159=Sterge automat Profilele Recente care lipsesc
'-------------------------------------------------------------------------------------
' Warning/Error/Info messages ***
'-------------------------------------------------------------------------------------
97=Discul a fost verificat. Doriti sa defragmentati fisierele?
143=Procesul de defragmentare nu poate fi oprit pana ce procesul este terminat. Doriti sa continuati?
147=The volume does not have a group of contiguous, free clusters that is large enough to contain the entire file.
164=Sunteti sigur ca doriti sa eliminati elementul din lista?
165=Sunteti sigur ca doriti sa eliminati elementele din lista?
166=Confirmare
205=WinContig nu poate rula pe acest sistem de operare.
233=Nu pot adauga '%s'.
307=Clasa de prioritate selectata nu se poate seta.
74=Inainte de a pornii procesul de defragmentare, doriti sa verificati discul de erori?
360=Fisierul '%s' din cauza urmatoarei erori:\n\n%s
374=Elementul selectat a fost adaugat listei de Excluderi.
375=Elementele selectate au fost adaugate listei de Excluderi.
376=Elementele selectate au fost deja adaugate listei de Excluderi.
465=Duplicated masks
466=One or more masks are included in both the Exclusion list and Inclusion list. The items matching those masks will not be processed by WinContig.
467=&Close anyway
468=&Edit masks
490=SSD Device Detected
494=SSD Device
491=SSD devices see no performance benefit from traditional HDD defragmentation. File defragmentation causes lots of write processes and can put undue wear on specific areas of the drive. It is recommended that you do not defragment files on SSD disks.
492=&Defragment anyway
493=&Don't defragment
149=There is not enough physical memory or system resources available to defragment the file.
'-------------------------------------------------------------------------------------
' General Buttons Captions ***
'-------------------------------------------------------------------------------------
395=&Da
396=&Nu
397=OK
398=Anuleaza
406=&Continua
407=&Iesire
142=&Close
'-------------------------------------------------------------------------------------
' File Open Error Messages ***
'-------------------------------------------------------------------------------------
167=Eroare: Memorie/Resurse insuficiente. Operatia nu poate fi ececutata!
168=Eroare: Fisierul nu a fost gasit. Operatia nu poate fi ececutata!
169=Eroare: Calea nu a fost gasita. Operatia nu poate fi ececutata!
170=Eroare: Formatul fisierului este incorect. Operatia nu poate fi ececutata!
'-------------------------------------------------------------------------------------
' "Fragmentation Details" dialog box ***
'-------------------------------------------------------------------------------------
259=Fragmente
260=Nume:
261=Cale:
262=Tip:
263=Dimensiune:
264=Dimensiune pe disc:
265=Fragmente:
266=Clustere:
267=Informatii fragment:
269=General
270=#
271=Clustere Fisiere
272=Cluster de inceput
273=Cluster de sfarsit
286=Dimensiune (bytes)
287=% din Fisier
276=Fisierul inca nu a fost analizat
277=Acest element nu este un fisier
278=A intervenit o eroare in timpul analizei acestui element.
279=Acest element nu exista
280=Acest fisier nu ocupa un cluster
281=bytes
'-------------------------------------------------------------------------------------
' "Defragmentation Report" dialog box ***
'-------------------------------------------------------------------------------------
184=Raport Defragmentare
185=Informatii:
186=Procesul de defragmentare este complet.
189=Numarul de fisiere procesate
190=Numarul de fisiere fragmentate
191=Numarul de fisiere continue
192=Numarul de fisiere defragmentate
193=Numarul de fisiere care nu au fost defragmentate datorita unor erori de procesare
423=Aceasta fereastra afiseaza informatii despre fisierele care au fost defragmentate.
'-------------------------------------------------------------------------------------
' Shutdown dialog box ***
'-------------------------------------------------------------------------------------
194=Inchide calculatorul
196=Sistemul se va inchide in 15 secunde.
197=Eroare OpenProcessToken.
198=Eroare AdjustTokenPrivileges.
'-------------------------------------------------------------------------------------
' About dialog box ***
'-------------------------------------------------------------------------------------
201=Toate drepturile rezervate.
202=Freeware pentru uz personal sau comercial.
203=WinContig consolideaza fisierele fragmentate astfel incat sa ocupe un spatiu continuu pe disc. \n\nCa rezultat, sistemul acceseaza fisierele mult mai eficient.
204=Despre
298=Pagina web:
299=E-mail:
'-------------------------------------------------------------------------------------
' Crash dialog box ***
'-------------------------------------------------------------------------------------
77=Exception of WinContig
78=WinContig has stopped working
79=We must report the program has encountered an error. Please copy the exception information to the Clipboard, and send it to us:
80=Problem details
81=&Close the program
63=SSD detection could be incompatible with some specific hardware combinations. Please select "Disable Solid State Drive (SSD) detection" from the "Options" menu.
'-------------------------------------------------------------------------------------
' Disclaimer ***
'-------------------------------------------------------------------------------------
206=Termeni de utilizare
'-------------------------------------------------------------------------------------
' Command line switches ***
'-------------------------------------------------------------------------------------
208=Scurtaturi in linie de comanda
389=Scurtaturi in linie de comanda
390=WinContig accepta un numar de comenzi optionale in linie de comanda pe care le puteti utiliza pentru a controla operatiunile programului.
'-------------------------------------------------------------------------------------
' Defragmentation/Analysis process Interrupted ***
'-------------------------------------------------------------------------------------
210=Va rog asteptati terminarea procesarii fisierului curent...
'-------------------------------------------------------------------------------------
' Disclaimer - RTF Format ***
'-------------------------------------------------------------------------------------
$d$
{\rtf1\ansi\ansicpg1252\deff0\deflang1033\deflangfe1040\deftab708{\fonttbl{\f0\fswiss\fprq2\fcharset0 Tahoma;}}
{\*\generator Msftedit 5.41.15.1507;}\viewkind4\uc1\pard\qc\lang1040\b\f0\fs24 Termeni de utilizare\par
\par
\pard\b0\fs16 Acest produs software si toate fisierele insotitoare sunt furnizate de autor "ca atare" si fara nici o garantie expresa sau implicita, incluzand, dar nelimitandu-se la garantiile implicite de comercializare si adecvare la un anumit scop. In niciun caz autorului nu va fi raspunzator pentru orice fel de daune (incluzand, fara limitare, daune prin pierderi de profit din sau de afaceri, pierderi de date datorate utilizarii, intreruperea de afaceri, pierderi de informatii de afaceri, sau orice alte pierderi pecuniare), care decurg din utilizarea sau incapacitatea de a utiliza acest produs, chiar daca ati fost informati de posibilitatea unor astfel de daune. Intregul risc care decurge din utilizarea sau de performantele acestui produs si documentatia sa ramane la competenta si decizia dumneavoastra.\par
}
$d$
'-------------------------------------------------------------------------------------
' Command line switches - RTF Format ***
'-------------------------------------------------------------------------------------
$c$
{\rtf1\ansi\ansicpg1252\deff0\deflang1040
\viewkind4\uc1\pard\lang1040\b\f0\fs16 SYNTAX\par
\b0\par
WINCONTIG.EXE [source] [/ANALYZE|/DEFRAG] [/CHKDSK:0|/CHKDSK:1|/CHKDSK:2] [/CLEAN:0|/CLEAN:1|/CLEAN:2] [/CLOSE|/CLOSEIFOK|/SHUTDOWN] [/DUP] [/FULLROW] [/HELP|/?] [/LANG:xx] [/NOGUI] [/NOINI] [/NOPROMPT] [/NOSCROLL] [/ONTOP] [/PROF:"profile"] [/QUICK]\par
\par
\b\par
IMPORTANT NOTES\par
\b0\par
\pard{\pntext\f3\'B7\tab}{\*\pn\pnlvlblt\pnf3\pnindent360{\pntxtb\'B7}}\fi-360\li360\tx360 Switches are not case sensitive, so, for example, \b /CLOSE\b0  is the same as \b /close\b0 .\par
{\pntext\f3\'B7\tab}When using multiple switches, separate them with a blank space. For example, use the following command line to load a profile and start the file defragmentation:\par
\pard\par
\pard\fi360\b WINCONTIG.EXE /DEFRAG /PROF:"c:\\datas\\profile.wcp"\b0\par
\pard\par
\par
Below is the list of the WinContig switches.\par
\par
\pard\fi-1418\li1418\tx1418\b source\b0\tab Specifies the file or folder to be loaded in WinContig.\par
\pard\par
\pard\fi-1418\li1418\tx1418\b\tab IMPORTANT NOTES\par
\b0\par
\pard{\pntext\f1\'B7\tab}{\*\pn\pnlvlblt\pnf1\pnindent360{\pntxtb\'B7}}\fi-360\li1778\tx1778 You must specify the full path of \i source\i0\par
{\pntext\f1\'B7\tab}You must enclose the full path of \i source\i0  in quotation marks ("")\par
\pard\li1418\tx1418\par
For example, use the following command line to load the file \i personal.txt\i0  located in \i c:\\documents\i0 :\par
\par
\b WINCONTIG.EXE "c:\\documents\\personal.txt"\b0\par
\par\pard\fi-1418\li1418\tx1418
\b /ANALYZE\b0\tab Starts automatically the analysis of the items loaded in WinContig.\par
\par
\b /CHKDSK:0\tab\b0 Disables the automatic disk checking. \par
\par
\b /CHKDSK:1\b0\tab Starts automatically the disk checking.\par
\par
\b /CHKDSK:2\b0\tab Asks the user before starting the disk checking.\par
\par
\b /CLEAN:0\tab\b0 Disables the automatic cleaning up of temporary files.\par
\par
\b /CLEAN:1\tab\b0 Starts automatically the cleaning up of temporary files.\par
\par
\b /CLEAN:2\tab\b0 Asks the user before starting the cleaning up of temporary files.\par
\par
\b /CLOSE\b0\tab Used to automatically close WinContig after it has completed the defragmentation process.\par
\par
\b /CLOSEIFOK\b0\tab Used to automatically close WinContig after it has completed the defragmentation process if all of the files have been successfully defragmented otherwise it stays open. 
If you use this switch in conjunction with the \b /NOGUI \b0 switch, WinContig will show the main window after it has completed the defragmentation process if one or more files have not been successfully defragmented.\par
\par
\b /DEFRAG\b0\tab Starts automatically the defragmentation of the items loaded in WinContig.\par
\par
\b /DUP\b0\tab Allows duplicate entries in the file list. WinContig does not allow duplicate entries in the file list as default. When using the \b /DUP\b0  switch, WinContig adds files to the file list faster. This option is useful if you want to load a very big profile faster and you are confident there are no duplicate entries in the profile.\par
\par
\b /FULLROW\b0\tab Turns full row selection on.\par
\par
\b /HELP \b0 or \b/?\b0 \tab Shows this dialog box.\par
\par
\b /LANG:\b0\i xx\i0\tab Forces the language used by the user interface. \i xx \i0 specifies a region-neutral language, for example \i en \i0 represents English, while \i fr \i0 represents French. 
If you specify the \b/LANG:auto \b0 switch, WinContig will use the system default UI language (if supported).\par
\par
\b /NOGUI\b0\tab Used to hide the WinContig main window during the analysis process or the defragmentation process. When using the \b /NOGUI\b0  switch, WinContig provides exit codes that indicate the level of success for a command.\par
\par
\tab\b Exit codes\b0\par
\par
\tab The following command-line exit codes are defined for WinContig.\par
\par
\tab\b 0\b0\tab Success.\par
\tab\b 1\b0\tab Invalid or missing profile.\par
\tab\b 2\b0\tab Errors found during disk checking.\par
\tab\b 3\b0\tab Not all items were defragmented successfully.\par
\tab\b 4\b0\tab Not all items were analyzed successfully.\par
\tab\b 5\b0\tab Invalid or missing item.\par
\par
\b /NOINI\b0\tab Used to suppress the writing of the "WinContig.ini" configuration file.\par
\par
\b /NOPROMPT\b0\tab Used to turn confirmation messages off.\par
\par
\b /NOSCROLL\b0\tab Turns scroll of the files off when WinContig performs an analysis process or a defragmentation process.\par
\par
\b /ONTOP\b0\tab Makes the WinContig main window topmost (above all other windows).\par
\par
\b /PROF:\b0\i "profile"\i0\tab Used to load the profile \i profile\i0 .\par
\par
\b\tab IMPORTANT NOTES\par
\b0\par
\pard{\pntext\f1\'B7\tab}{\*\pn\pnlvlblt\pnf1\pnindent360{\pntxtb\'B7}}\fi-360\li1778\tx1778 You must specify the full path of the profile\par
{\pntext\f1\'B7\tab}You must enclose the full path of the profile in quotation marks ("")\par
\pard\li1418\tx1418\par
For example, use the following command line to load the profile \i data.wcp\i0  located in \i c:\\profiles\i0 :\par
\par
\b WINCONTIG.EXE /PROF:"c:\\profiles\\data.wcp"\par
\pard\fi-1418\li1418\tx1418\b0\par
\b /QUICK\b0\tab Used to turn off optimizations during the defragmentation process (i.e. it will not try to fill the gaps and it will not try to partially defragment the files that it's not possibile to totally defrag). This allows to complete the defragmentation process quicker.\par
\par
\b /SHUTDOWN\b0\tab Used to shutdown the computer after WinContig has completed the defragmentation process.\par
\par
}
$c$





